In [2]:
import pandas as pd
import sqlite3
import contextlib

In [3]:
sql_connect = sqlite3.connect('../database.sqlite')
cursor = sql_connect.cursor()

Alle tabellen inladen en analyseren

In [4]:
tables = pd.read_sql("""SELECT *
                        FROM sqlite_master
                        WHERE type='table';""", sql_connect)
tables

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,4,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,Player_Attributes,Player_Attributes,11,"CREATE TABLE ""Player_Attributes"" (\n\t`id`\tIN..."
2,table,Player,Player,14,CREATE TABLE `Player` (\n\t`id`\tINTEGER PRIMA...
3,table,Match,Match,18,CREATE TABLE `Match` (\n\t`id`\tINTEGER PRIMAR...
4,table,League,League,24,CREATE TABLE `League` (\n\t`id`\tINTEGER PRIMA...
5,table,Country,Country,26,CREATE TABLE `Country` (\n\t`id`\tINTEGER PRIM...
6,table,Team,Team,29,"CREATE TABLE ""Team"" (\n\t`id`\tINTEGER PRIMARY..."
7,table,Team_Attributes,Team_Attributes,2,CREATE TABLE `Team_Attributes` (\n\t`id`\tINTE...

***Beschikbare Tabellen***

- Country
- League
- Match
- Team
- Team_Attributes
- Player
- Player_Attributes

In [13]:
countries = pd.read_sql("""SELECT *
                        FROM Country;""", sql_connect)
countries

       id         name
0       1      Belgium
1    1729      England
2    4769       France
3    7809      Germany
4   10257        Italy
5   13274  Netherlands
6   15722       Poland
7   17642     Portugal
8   19694     Scotland
9   21518        Spain
10  24558  Switzerland

In [14]:
leagues = pd.read_sql("""SELECT *
                        FROM League as l
                        JOIN Country as c ON l.country_id == c.id;""", sql_connect)
leagues

       id  country_id                      name     id         name
0       1           1    Belgium Jupiler League      1      Belgium
1    1729        1729    England Premier League   1729      England
2    4769        4769            France Ligue 1   4769       France
3    7809        7809     Germany 1. Bundesliga   7809      Germany
4   10257       10257             Italy Serie A  10257        Italy
5   13274       13274    Netherlands Eredivisie  13274  Netherlands
6   15722       15722        Poland Ekstraklasa  15722       Poland
7   17642       17642  Portugal Liga ZON Sagres  17642     Portugal
8   19694       19694   Scotland Premier League  19694     Scotland
9   21518       21518           Spain LIGA BBVA  21518        Spain
10  24558       24558  Switzerland Super League  24558  Switzerland

In [35]:
Matches = pd.read_sql("""SELECT *
                        FROM Match
                        LIMIT 5;""", sql_connect)
Matches

,id,country_id,league_id,season,stage,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,...,SJA,VCH,VCD,VCA,GBH,GBD,GBA,BSH,BSD,BSA
0,1,1,1,2008/2009,1,2008-08-17 00:00:00,492473,9987,9993,1,...,4.00,1.65,3.40,4.50,1.78,3.25,4.00,1.73,3.40,4.20
1,2,1,1,2008/2009,1,2008-08-16 00:00:00,492474,10000,9994,0,...,3.80,2.00,3.25,3.25,1.85,3.25,3.75,1.91,3.25,3.60
2,3,1,1,2008/2009,1,2008-08-16 00:00:00,492475,9984,8635,0,...,2.50,2.35,3.25,2.65,2.50,3.20,2.50,2.30,3.20,2.75
3,4,1,1,2008/2009,1,2008-08-17 00:00:00,492476,9991,9998,5,...,7.50,1.45,3.75,6.50,1.50,3.75,5.50,1.44,3.75,6.50
4,5,1,1,2008/2009,1,2008-08-16 00:00:00,492477,7947,9985,1,...,1.73,4.50,3.40,1.65,4.50,3.50,1.65,4.75,3.30,1.67

In [36]:
Teams = pd.read_sql("""SELECT *
                        FROM Team
                        LIMIT 5;""", sql_connect)
Teams

   id  team_api_id  team_fifa_api_id     team_long_name team_short_name
0   1         9987               673           KRC Genk             GEN
1   2         9993               675       Beerschot AC             BAC
2   3        10000             15005   SV Zulte-Waregem             ZUL
3   4         9994              2007   Sporting Lokeren             LOK
4   5         9984              1750  KSV Cercle Brugge             CEB

In [37]:
Team_Attributes = pd.read_sql("""SELECT * 
                              FROM Team as t
                              JOIN Team_Attributes as ta  
                              USING (team_api_id)
                              LIMIT 5;""", sql_connect)
Team_Attributes

,id,team_api_id,team_fifa_api_id,team_long_name,team_short_name,id,team_fifa_api_id,date,buildUpPlaySpeed,buildUpPlaySpeedClass,...,chanceCreationShooting,chanceCreationShootingClass,chanceCreationPositioningClass,defencePressure,defencePressureClass,defenceAggression,defenceAggressionClass,defenceTeamWidth,defenceTeamWidthClass,defenceDefenderLineClass
0,49119,9930,434,FC Aarau,AAR,1,434,2010-02-22 00:00:00,60,Balanced,...,55,Normal,Organised,50,Medium,55,Press,45,Normal,Cover
1,49119,9930,434,FC Aarau,AAR,2,434,2014-09-19 00:00:00,52,Balanced,...,64,Normal,Organised,47,Medium,44,Press,54,Normal,Cover
2,49119,9930,434,FC Aarau,AAR,3,434,2015-09-10 00:00:00,47,Balanced,...,64,Normal,Organised,47,Medium,44,Press,54,Normal,Cover
3,39393,8485,77,Aberdeen,ABE,4,77,2010-02-22 00:00:00,70,Fast,...,70,Lots,Organised,60,Medium,70,Double,70,Wide,Cover
4,39393,8485,77,Aberdeen,ABE,5,77,2011-02-22 00:00:00,47,Balanced,...,52,Normal,Organised,47,Medium,47,Press,52,Normal,Cover

In [38]:
players = pd.read_sql("""SELECT *
                        FROM Player
                        LIMIT 5;""", sql_connect)
players

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187
1,2,155782,Aaron Cresswell,189615,1989-12-15 00:00:00,170.18,146
2,3,162549,Aaron Doran,186170,1991-05-13 00:00:00,170.18,163
3,4,30572,Aaron Galindo,140161,1982-05-08 00:00:00,182.88,198
4,5,23780,Aaron Hughes,17725,1979-11-08 00:00:00,182.88,154

In [39]:
player_attributes = pd.read_sql("""SELECT * 
                              FROM Player as p
                              JOIN Player_Attributes as pa
                              USING (player_api_id)
                              LIMIT 5;""", sql_connect)
player_attributes

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight,id,player_fifa_api_id,date,...,vision,penalties,marking,standing_tackle,sliding_tackle,gk_diving,gk_handling,gk_kicking,gk_positioning,gk_reflexes
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,1,218353,2016-02-18 00:00:00,...,54,48,65,69,69,6,11,10,8,8
1,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,2,218353,2015-11-19 00:00:00,...,54,48,65,69,69,6,11,10,8,8
2,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,3,218353,2015-09-21 00:00:00,...,54,48,65,66,69,6,11,10,8,8
3,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,4,218353,2015-03-20 00:00:00,...,53,47,62,63,66,5,10,9,7,7
4,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,5,218353,2007-02-22 00:00:00,...,53,47,62,63,66,5,10,9,7,7

Belangrijkste indentifiers Manchester United

Analyseren seizoen 2012/2013

In [6]:
man_u_2012_2013 = pd.read_sql("""SELECT Match.id, 
                                        Country.name AS country_name, 
                                        League.name AS league_name, 
                                        season, 
                                        stage, 
                                        date,
                                        HT.team_long_name AS  home_team,
                                        AT.team_long_name AS away_team,
                                        home_team_goal, 
                                        away_team_goal                                        
                                FROM Match
                                JOIN Country on Country.id = Match.country_id
                                JOIN League on League.id = Match.league_id
                                LEFT JOIN Team AS HT on HT.team_api_id = Match.home_team_api_id
                                LEFT JOIN Team AS AT on AT.team_api_id = Match.away_team_api_id
                                WHERE country_name = 'England'
                                AND season = "2012/2013"
                                AND (home_team = "Manchester United" 
                                        OR away_team = "Manchester United")                                
                                ORDER by date
                                LIMIT 5
                                ;""", sql_connect)
man_u_2012_2013

,id,country_name,league_name,season,stage,date,home_team,away_team,home_team_goal,away_team_goal
0,3250,England,England Premier League,2012/2013,1,2012-08-20 00:00:00,Everton,Manchester United,1,0
1,3362,England,England Premier League,2012/2013,2,2012-08-25 00:00:00,Manchester United,Fulham,3,2
2,3473,England,England Premier League,2012/2013,3,2012-09-02 00:00:00,Southampton,Manchester United,2,3
3,3573,England,England Premier League,2012/2013,4,2012-09-15 00:00:00,Manchester United,Wigan Athletic,4,0
4,3580,England,England Premier League,2012/2013,5,2012-09-23 00:00:00,Liverpool,Manchester United,1,2

In [7]:
prem_2012_2013 = pd.read_sql("""SELECT Match.id, 
                                        Country.name AS country_name, 
                                        League.name AS league_name, 
                                        season, 
                                        stage, 
                                        date,
                                        HT.team_long_name AS  home_team,
                                        AT.team_long_name AS away_team,
                                        home_team_goal, 
                                        away_team_goal                                        
                                FROM Match
                                JOIN Country on Country.id = Match.country_id
                                JOIN League on League.id = Match.league_id
                                LEFT JOIN Team AS HT on HT.team_api_id = Match.home_team_api_id
                                LEFT JOIN Team AS AT on AT.team_api_id = Match.away_team_api_id
                                WHERE country_name = 'England'
                                AND season = "2012/2013"                                
                                ORDER by date
                                LIMIT 5
                                ;""", sql_connect)
prem_2012_2013

,id,country_name,league_name,season,stage,date,home_team,away_team,home_team_goal,away_team_goal
0,3249,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Arsenal,Sunderland,0,0
1,3251,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Fulham,Norwich City,5,0
2,3253,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Newcastle United,Tottenham Hotspur,2,1
3,3254,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Queens Park Rangers,Swansea City,0,5
4,3255,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Reading,Stoke City,1,1

In [ ]:
query_r = "SELECT * FROM player" # read query van country tabel
query_r = "PRAGMA table_info(player)"

In [ ]:
result = cursor.execute(query_r).fetchall()
sql_connect.commit()
df_player = pd.DataFrame(result)
display(result)

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'player_api_id', 'INTEGER', 0, None, 0),
 (2, 'player_name', 'TEXT', 0, None, 0),
 (3, 'player_fifa_api_id', 'INTEGER', 0, None, 0),
 (4, 'birthday', 'TEXT', 0, None, 0),
 (5, 'height', 'INTEGER', 0, None, 0),
 (6, 'weight', 'INTEGER', 0, None, 0)]